{"data":{"markdownRemark":{"html":"<h2>The problem: Your data isn’t safe in the cloud</h2>\n<img alt=\"bittorrentsync\" src=\"https://blog.resilio.com/wp-content/uploads/2013/11/bittorrentsync.png\" style=\"float:right\"/>\n<p>On a daily basis, many people are constantly backing up files on their personal Dropbox drive. While there’s really nothing wrong with this, what would happen if Dropbox were to get hacked? I’m sure nobody saw it coming when <a href=\"http://en.wikipedia.org/wiki/PlayStation_Network_outage\">PlayStation Network got hacked</a>, yet, around 77 million people had their personal information stolen. What would happen if that same thing happened to Dropbox, where millions of people store sensitive data?</p>\n<p>Sure this is probably an extreme case, but one that hits closer to home would be the recent unveiling of project PRISM. Do you really want the National Security Agency (NSA) to have access to your data? Of course there’s still risk of your own personal servers getting hacked or monitored by the NSA, but a data archiving company such as Dropbox would be a higher target than John Smith’s personal file server.\nThe solution: BitTorrent Sync on your own server</p>\n<p>Recently, the folks at BitTorrent created <a href=\"http://bit.ly/1hhKFWK\">BitTorrent Sync</a>. This service lives on all your machines and can keep whatever folders you select in sync. Even more amazingly, you can have a folder shared on as many (or few) devices as you want! Being a Peer-To-Peer protocol, there’s no need for a remote server. So, it can live in your local area network and never reach out to external servers!</p>\n<p>There is however one drawback to this method of file syncing. If your home computers (which are running BitTorrent Sync) are turned off, you won’t be able to download your files on the go using your iPhone or Android device. You’ll have similar results if you’re on the go and your home network just happens to go down.</p>\n<p>The solution to this problem is to create a remote “Dropbox” like service, housed on your own server! Unfortunately, this method will not be free, but it’s still cheaper than paying a cloud service. Plus it’ll be much more reliable for keeping your devices always in sync. To start off, you need to buy a server to host your files on (if you don’t own one already). This guide will be for Linux based servers (I’m using Ubuntu). I highly recommend <a href=\"https://www.digitalocean.com/?refcode=160ceb9f7d71\">DigitalOcean</a> as a host. They use SSD and are extremely reasonably priced. Did I mention they’re blazing fast too? Okay, enough of the sales pitch.</p>\n<p>Once you have your server ready to go, I recommend taking a few moments to configure your server’s security. There’s a quick and painless guide on securing a Ubuntu server <a href=\"http://plusbryan.com/my-first-5-minutes-on-a-server-or-essential-security-for-linux-servers\">here</a>.</p>\n<h2>Once your server is secured, install BitTorrent Sync!</h2>\n<p><a href=\"http://bit.ly/1hhKFWK\">Get BitTorrent Sync.</a></p>\n<p>We’ll need to know whether our system is 32 or 64 bit. If you’re not sure which to install, SSH into your server and run <code class=\"language-text\">file /sbin/init</code>.</p>\n<h3>If the output contains <code class=\"language-text\">32-bit</code></h3>\n<p>Then SSH into your server and run:</p>\n<div class=\"gatsby-highlight\" data-language=\"term\">\n      <pre class=\"language-term\"><code class=\"language-term\">curl -L http://download-lb.utorrent.com/endpoint/btsync/os/linux-i386/track/stable &gt; btsync.tar</code></pre>\n      </div>\n<h3>If the output contains <code class=\"language-text\">64-bit</code></h3>\n<p>Then SSH into your server and run:</p>\n<div class=\"gatsby-highlight\" data-language=\"term\">\n      <pre class=\"language-term\"><code class=\"language-term\">curl -L http://download-lb.utorrent.com/endpoint/btsync/os/linux-x64/track/stable &gt; btsync.tar</code></pre>\n      </div>\n<p>Now let’s go ahead and extract the files from the tar by running</p>\n<div class=\"gatsby-highlight\" data-language=\"term\">\n      <pre class=\"language-term\"><code class=\"language-term\">tar -xvf btsync.tar</code></pre>\n      </div>\n<p>This should leave you with two files: <code class=\"language-text\">btsync</code> and <code class=\"language-text\">LICENSE.TXT</code>. You can go ahead and remove the license file if you’d like (<code class=\"language-text\">sudo rm LICENSE.TXT</code>). To keep things clean, I’m going to place the btsync executable in <code class=\"language-text\">/BTSync/</code> and put the folders I want to sync inside <code class=\"language-text\">/BTSync/folders/</code>.</p>\n<p>To create this file structure, just run</p>\n<div class=\"gatsby-highlight\" data-language=\"term\">\n      <pre class=\"language-term\"><code class=\"language-term\">sudo mkdir -p /BTSync/folders/</code></pre>\n      </div>\n<p>which will create both directories. Then we can move the btsync executable to the folder by running</p>\n<div class=\"gatsby-highlight\" data-language=\"term\">\n      <pre class=\"language-term\"><code class=\"language-term\">sudo mv btsync /BTSync/</code></pre>\n      </div>\n<p>Next, we’re going to make the btsync process auto-start when our server boots. So run</p>\n<div class=\"gatsby-highlight\" data-language=\"term\">\n      <pre class=\"language-term\"><code class=\"language-term\">sudo nano /etc/rc.local</code></pre>\n      </div>\n<p>and add in <code class=\"language-text\">/BTSync/btsync</code> on any line before <code class=\"language-text\">exit 0</code>.</p>\n<p>At this point we’re almost done! You can startup BTSync by running</p>\n<div class=\"gatsby-highlight\" data-language=\"term\">\n      <pre class=\"language-term\"><code class=\"language-term\">sudo /BTSync/btsync</code></pre>\n      </div>\n<p>Once it starts running, navigate to <code class=\"language-text\">http://yourserver:8888</code>. After creating your username and password, you can begin adding your BitTorrent Sync folders!</p>\n<h2>A BitTorrent Sync guide for newcomers</h2>\n<p>If I left you a little confused after the last section, no worries! I’m here to hold your hand and guide you through the wonderful world of BitTorrent Sync! If you haven’t already, download and install <a href=\"http://bit.ly/1hhKFWK\">BitTorrent Sync</a> on your local computer. Once you launch the program, you’ll see a window where you can add in folders to sync. It will look like this, only blank</p>\n<p><img src=\"https://blog.resilio.com/wp-content/uploads/2013/11/btsync-folderwindow.png\" alt=\"btsync-folderwindow\"></p>\n<p>Click the + button in the bottom left to add a new folder to sync.</p>\n<p><img src=\"https://blog.resilio.com/wp-content/uploads/2013/11/btsync-add-folder.png\" alt=\"btsync-add-folder\"></p>\n<p>You’re going to want to generate a new shared secret and then choose the folder you want to sync to your server. In this example, I’m going to sync a folder for a project I’m working on.</p>\n<p><img src=\"https://blog.resilio.com/wp-content/uploads/2013/11/btsync-add-folder-8bit.png\" alt=\"btsync-add-folder-8bit\"></p>\n<p>Once the folder is added, it’ll show up inside your folder list.</p>\n<p><img src=\"https://blog.resilio.com/wp-content/uploads/2013/11/btsync-folder-list-new.png\" alt=\"btsync-folder-list-new\"></p>\n<p>Now right-click on the folder from this list and choose “Copy Secret”. Before we can add this to our server, we need to create the folder it’ll sync to! So SSH into your server and run</p>\n<div class=\"gatsby-highlight\" data-language=\"term\">\n      <pre class=\"language-term\"><code class=\"language-term\">sudo mkdir /BTSync/folders/my-folder-name/</code></pre>\n      </div>\n<p>At this point we’re going to navigate back to our server’s BTSync interface, which is located at <code class=\"language-text\">http://yourserver:8888</code> and click the <code class=\"language-text\">Add Folder</code> button. Paste in the secret you copied and select the folder you just created.</p>\n<p><img src=\"https://blog.resilio.com/wp-content/uploads/2013/11/btsync-add-remote-folder.png\" alt=\"btsync-add-remote-folder\"></p>\n<p>It’ll immediately add the folder and start syncing with your computer. Congratulations, you’ve now created a remote cloud that syncs with your home computer! You can now add this folder on any computer or mobile phone by downloading the app and using the secret key!</p>\n<h2>Set up a public folder</h2>\n<p>People love that you can just drag and drop a file into your Dropbox’s public folder to quickly share files with friends, family, or colleagues. Before continuing, I recommend setting up a public domain that you can access the server from. There’s a good guide for setting that up <a href=\"https://www.digitalocean.com/community/articles/how-to-set-up-apache-virtual-hosts-on-ubuntu-12-04-lts\">here</a>.</p>\n<p>Once you have that setup, we’re going to add a folder just like before! Only now, from the BitTorrent Sync web interface, you’re going to select a directory that’s located inside your <code class=\"language-text\">public_html</code> folder! Now when you add files into your local directory, your friends can download them by going to <code class=\"language-text\">http://yourdomain.com/public_sync_folder/file.zip</code></p>\n<h2>Closing thoughts</h2>\n<p>So now I’m at the boring end segment of my guide. I hope you guys learned something from this guide, and I hope that you enjoy your brand new private Dropbox service! If you need more help setting it up or you ran into a problem/error, just leave a comment below and I’ll help you as soon as possible!</p>\n<p>Thanks for reading!</p>","frontmatter":{"title":"A Complete Guide to Creating Your Own Private Dropbox-like Server","date":"20 January, 2015"}}},"pageContext":{"slug":"/posts/private-dropbox-server-btsync/"}}