{"data":{"markdownRemark":{"html":"<img alt=\"mouse running gif\" src=\"http://imgur.com/vQV1W7B.gif\" style=\"float:right\"/>\n<p>What if I told you I had a secret weapon that could make you a faster programmer… would you believe me?</p>\n<p>What if I told you that part of the secret to becoming a faster programmer is removing one of your input devices from your computer?</p>\n<p><em>… You’re kidding me right?</em></p>\n<p>Not at all. In fact, I can work an entire 10 hour day without ever touching my mouse or trackpad while coding… and so can you. In fact, this entire blog was developed without the use of a mouse —other than testing in a web browser.</p>\n<h2>What I’m referring to, is the vim way of working.</h2>\n<p>I’m sure you’ve used vim at least a few different times before. It’s that little text editor that you only use on your linux server and can never seem to figure out how to close or save a file.</p>\n<p>But it’s more than that...</p>\n<p>It's more than an editor.</p>\n<p>Vim is it’s own language. A language for writers. A language for developers. I could go on and on, because Vim is more than a code editor —it’s a platform.</p>\n<p>But at the core of that platform, lies one simple concept...</p>\n<h2>USE THE KEYBOARD</h2>\n<p>By it’s very nature, the mouse slows us down. By us, I should say that I’m referring to the group of people I originally intended this article for — software engineers. We work all day typing away, whether it’s in our IDE, CLI, IRC, ETC… When does it actually make sense to use a mouse?</p>\n<p>I’m not just saying this to say something extreme and spark an argument within the community either. I want you to actually sit back and think about when it make sense for a software engineer to use a mouse during development.</p>\n<p>There are obviously going to be a few edge cases where you have no other choice; but for the most part, we can arrange the majority of our tools in a way that requires us to use literally zero cursor input.</p>\n<h3>The advantage?</h3>\n<p>It takes time and effort to move your hand off the keyboard. This is especially true if you use an actual mouse. But if you use a trackpad, you aren't safe either. I know firsthand that the awkward \"hinge\" motion of moving my right-hand fingers from my keyboard to my trackpad can cause difficulties.</p>\n<p>After a full day of working on my laptop using both my keyboard and trackpad, I find myself constantly trying to stretch out my wrists to relieve them of pain and cramps. There's no way that this is good for the long-term health of one of my favorite appendages.</p>\n<p>But there's more to it than just slicing milliseconds off of your workflow and preventing carpel tunnel. It keeps you focused <strong>on your work</strong>.</p>\n<p>It does this, by implementing multiple modes. Most code editors have a single mode, insert. Every keystroke made while focused on the code editor, will cause that key to be inserted into the editor. But vim goes beyond a basic insert mode.</p>\n<p>Vim contains 3 primary modes:</p>\n<ul>\n<li>Normal</li>\n<li>Insert</li>\n<li>Visual</li>\n</ul>\n<h4>Normal Mode</h4>\n<p>Normal mode is the inital mode that loads on vim. It's primary function is for moving around the cursor. You can do this using the key visualization below</p>\n<pre><code class=\"language-python\">↑\nk\n← h l →\nj\n↓\n</code></pre>\n<p>These keys move the cursor one position in their respective direction. It's pretty bad practice to just repeatedly tap away on these keys to get where you wanna go though. There's much faster ways to navigate, like these (keys are case-sensitive in vim, all uppercase letters represent <code>shift</code>+<code>letter</code>):</p>\n<ul>\n<li><code>0</code> = move to the beginning of the line</li>\n<li><code>$</code> = move to the end of the line</li>\n<li><code>w</code> = move to the beginning of the next word</li>\n<li><code>b</code> = move to the beginning of the previous word</li>\n<li><code>gg</code> = move to the beginning of the file</li>\n<li><code>G</code> = move to the end of the file</li>\n<li><code>(</code> = move to the previous sentence</li>\n<li><code>)</code> = move to the next sentence</li>\n<li><code>{</code> = move to the previous paragraph</li>\n<li><code>}</code> = move to the next paragraph</li>\n</ul>\n<p>You can also add a number before any movement command to repeat it <code>x</code> amount of times. i.e. <code>2w</code> moves the cursor forward 2 words.</p>\n<h2>Is this really faster than a mouse?</h2>\n<p>Let's take a moment to think about the logic that takes place in our brains during a typical coding session inside an editor like Atom.</p>\n<p>Let's imagine a scenario where you're in the middle of coding a function and you need to move your cursor to the very beginning of the function. Maybe it's to rename it, maybe it's to add more arguments, or maybe you wanna shift it down a few lines. What you're doing after then is irrelevant. All I really care about, is moving that damn cursor back to the beginning of the function name.</p>\n<pre><code class=\"language-js\">function foo(bar) {\nreturn bar * 2;|\n}\n</code></pre>\n<p>*I put a <code>|</code> in there to represent the cursor.*</p>\n<p>You are feeling confident. You just wrote a function and even remembered to insert a semicolon! So let's so back to the beginning of the word <code>foo</code>. No big deal, right?</p>\n<h4>Logic</h4>\n<ol>\n<li>Move your eyes upwards from the current cursor position in search of the function name.</li>\n<li>Located the function name, move right hand down to trackpad.</li>\n<li>Shit. The mouse isn't close by. Move your eyes away from the function name in an attempt to locate your cursor.</li>\n<li>Located the cursor. Now move the cursor along with my eyes in an attempt to re-locate the function name.</li>\n<li>Found the function name, cursor is over it. Move to the beginning of the word.</li>\n<li>Click.</li>\n<li>Move right hand back to the keyboard.</li>\n</ol>\n<p>The operation was simple. We needed to do one thing. Yet it took our brain 7 steps to complete it. Not just that, one of those steps is <em>relatively</em> time consuming.</p>\n<p>Now let's look at doing that <strong>exact same</strong> operation using vim with <a href=\"https://github.com/easymotion/vim-easymotion\">easymotion</a>.</p>\n<h4>Logic</h4>\n<ol>\n<li>Move your eyes upwards from the current cursor position in search of the function name</li>\n<li>Located the function name. Press <code>\\\\</code> twice on the keyboard followed by a direction (<code>w</code> to go forwards, <code>B</code> to go backwards)</li>\n<li>The first letter of our function name will transform into a red letter, read that letter!</li>\n<li>Now press it on the keyboard.</li>\n</ol>\n<p>That's it. We're there. It took us 4 steps, none of which are time consuming at all. We were able to cut out all wrist and extreme finger motions to get exactly where we wanted to go.</p>\n<p><img src=\"http://imgur.com/vDbriEb.gif\"></p>\n<p>At first, expect it to feel a little awkward. It always does the first time. But after you have some time to explore how it reacts to your every touch, you'll be keystroking all over this beautiful code editor.</p>\n<p>It may seem like I'm greatly trivializing this comparison by comparing something so basic. But in reality, the only thing we do more than type while programming, is move the cursor around.</p>\n<p>After we've written our initial lines, the rest of the time spent in that file is refactoring the code to make it work better. If you have to repeat the same task over and over and over again all day long, doesn't it make sense to choose the option that takes half the amount of brain power?</p>\n<p>Glancing away from your editor for a brief moment to find the cursor may seem like a trivial task, but repeated all day long, can definitely cause mental fatigue as well as loss of focus. Our biggest source of distractions as developers is looking away from our editors, this is why I have notifications silenced on my computer while I work. The act of glancing away for a mere second can cause a flood of external thoughts and stimuli that distract you from the task you're trying to accomplish.</p>\n<h2>Build your own experience.</h2>\n<p><img src=\"http://2.bp.blogspot.com/-eY0-35xiGxg/UsAji64nNNI/AAAAAAAADfc/g3gYVMeDyyM/s1600/modular+christmas+2-TWINKLE.gif\"></p>\n<p>Out of the box, vim is a bit lackluster. If you're familiar with the vim workflow, you'll be able to get around just fine, but it's definitely not an ideal development environment for daily use. To get the most out of vim, you have to customize it for your own needs.</p>\n<p>Luckily vim has been around for over 20 years, there's no shortage of extensions. The first thing you'll want to do though, is install a plugin manager. I personally recommend <a href=\"https://github.com/junegunn/vim-plug\">vim-plug</a>. It's extremely minimalistic and works great.</p>\n<p>I plan to write a follow-up article before long with in-depth information on customization for specific languages; but for now, here's a list of my language-agnostic plugin recommendations. No need to go nuts and install every single one, just look through them and choose the ones right for you.</p>\n<ul>\n<li><a href=\"https://github.com/mhinz/vim-startify\">vim-startify</a> - Smart startup screen</li>\n<li><a href=\"https://github.com/notpratheek/vim-luna\">vim-luna</a> - My current syntax theme</li>\n<li><a href=\"https://github.com/tpope/vim-fugitive\">vim-fugitive</a> - Incredibly powerful git integration</li>\n<li><a href=\"https://github.com/airblade/vim-gitgutter\">vim-gitgutter</a> - See git diffs in the gutter</li>\n<li><a href=\"https://github.com/editorconfig/editorconfig-vim\">editorconfig</a> - Add support for <code>.editorconfig</code> files</li>\n<li><a href=\"https://github.com/easymotion/vim-easymotion\">vim-easymotion</a> - Do those awesome motions that I did in the gif above</li>\n<li><a href=\"https://github.com/Shougo/deoplete.nvim\">deoplete</a> - Asynchronous auto-complete (Neovim only)</li>\n<li><a href=\"https://github.com/kien/ctrlp.vim\">ctrlp</a> - Add a fuzzy-finder</li>\n<li><a href=\"https://majutsushi.github.io/tagbar/\">tagbar</a> - Browse your code by tags</li>\n<li><a href=\"https://github.com/vim-airline/vim-airline\">vim-airline</a> - Add beautiful status bars</li>\n<li><a href=\"https://github.com/scrooloose/nerdtree\">vim-nerdtree</a> - Add an awesome sidebar</li>\n<li><a href=\"https://github.com/Xuyuanp/nerdtree-git-plugin\">vim-nerdtree-git-plugin</a> - Show gif diffs in the sidebar.</li>\n</ul>\n<h2>In conclusion</h2>\n<p>It's faster to not have to move your hands back and forth from your keyboard to mouse. Who would've thought?</p>","frontmatter":{"title":"75% less mouse, 100% more productive —a vim story"}}},"pageContext":{"slug":"/posts/why-vim/"}}